In [1]:
import pandas as pd

데이터를 불러와 볼까요?

In [5]:
url = "https://raw.githubusercontent.com/daje0601/pandas_study/main/data_example/titanic.csv"

In [7]:
df = pd.read_csv(url)
df.shape

(891, 12)

In [8]:
df.head()

   Unnamed: 0  Survived  Pclass  ...     Fare Cabin  Embarked
0           0         0       3  ...   7.2500   NaN         S
1           1         1       1  ...  71.2833   C85         C
2           2         1       3  ...   7.9250   NaN         S
3           3         1       1  ...  53.1000  C123         S
4           4         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

성별에 대해서 ont-hot-encoding을 해보겠습니다.

get_dummies라는 method를 사용하면 됩니다.

In [12]:
df1 = df["Sex"]

In [14]:
one_hot_encodede_df1 = pd.get_dummies(df1)
one_hot_encodede_df1

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

그런데요.. 위처럼 빼온 데이터를 다시 합치는게 문제가 있죠?(귀찮죠..그리고 df에 맨 뒷쪽으로 데이터가 합쳐지구요)

이러한 문제를 해결하기 위해 우리의 친절한 개발자 선배님들께서 default로 몇가지 기능을 만들어두셨습니다.

아래와 같이 파라미터를 같이 넘겨준다면 기존 df에서 바로 원하는 columns만 one_hot_encoding이 진행됩니다^^

**전체 데이터에서 원하는 columns만 one_hot_encoding하는 방법**

In [15]:
one_hot_encodede_df = pd.get_dummies(data=df, columns=["Sex", "Embarked"])
one_hot_encodede_df

     Unnamed: 0  Survived  Pclass  ... Embarked_C  Embarked_Q  Embarked_S
0             0         0       3  ...          0           0           1
1             1         1       1  ...          1           0           0
2             2         1       3  ...          0           0           1
3             3         1       1  ...          0           0           1
4             4         0       3  ...          0           0           1
..          ...       ...     ...  ...        ...         ...         ...
886         886         0       2  ...          0           0           1
887         887         1       1  ...          0           0           1
888         888         0       3  ...          0           0           1
889         889         1       1  ...          1           0           0
890         890         0       3  ...          0           1           0

[891 rows x 15 columns]